tutorials/fluidSolidInteraction/HronTurekFsi3RANS/constant/solid/solidProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      solidProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//solidModel nonLinearGeometryUpdatedLagrangian;
//solidModel unsNonLinearGeometryUpdatedLagrangian;
//solidModel nonLinearGeometryTotalLagrangian;
solidModel unsNonLinearGeometryTotalLagrangian;

unsNonLinearGeometryTotalLagrangianCoeffs
{
    nCorrectors             1000;
    solutionTolerance       1e-7;
    relConvergenceTolerance 1e-3;

    // Gravity
    //g g [0 1 -2 0 0 0 0] (0 -2 0);
}

// ************************************************************************* //
